OpenFOAM/2.2.x/ERCOFTAC-SIG15/case13.1/steadyState/alpha_4.1/share/Allrun.pre
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication renumberMesh -overwrite
runApplication checkMesh -constant 

cp -a 0.orig 0
